#############################
# это файл настройки СОЗДАНИЯ свое собственного образа для докера
#############################

# Указываем на основе какого образа будет создан новый образ
FROM python:3-alpine

# указяваем переменные окружаешей среды внутри контенера
ENV PYTHONDONTWRITEBYTECODE=1
ENV PYTHONUNBUFFERED=1

# создаем рабочую директоию (создаем папку и переходим в нее)
WORKDIR /server

# копируем локальный файл в папку (./ - текущая папка)
COPY requirements.txt ./

# Устанавливаем необходимые пакеты для питона
RUN pip install -r requirements.txt

# копируем код сервера 
COPY ./server ./

# открываем во вне порт контенера
EXPOSE 8000

# выполняем команду при запуске контенера
CMD ["manage.py", "runserver", "0.0.0.0:8000"]
